{"meta":{"title":"ylzx world","subtitle":"（´-`）.｡oO（ ​​​","description":"个人区","author":"ylzx","url":"https://ylzxkk1.github.io","root":"/"},"pages":[{"title":"about","date":"2022-01-27T05:56:02.000Z","updated":"2022-01-27T05:56:19.402Z","comments":true,"path":"about/index.html","permalink":"https://ylzxkk1.github.io/about/index.html","excerpt":"","text":"title: aboutdate: 2018-09-30 17:25:30type: “about”layout: “about”"},{"title":"tags","date":"2022-01-27T05:55:19.000Z","updated":"2022-01-27T05:55:33.540Z","comments":true,"path":"tags/index.html","permalink":"https://ylzxkk1.github.io/tags/index.html","excerpt":"","text":"title: tagsdate: 2018-09-30 18:23:38type: “tags”layout: “tags”"},{"title":"categories","date":"2022-01-27T05:54:30.000Z","updated":"2022-01-27T05:54:54.485Z","comments":true,"path":"categories/index.html","permalink":"https://ylzxkk1.github.io/categories/index.html","excerpt":"","text":"title: categoriesdate: 2018-09-30 17:25:30type: “categories”layout: “categories”"}],"posts":[{"title":"寻找问题的答案","slug":"寻找问题的答案","date":"2022-02-08T16:05:44.000Z","updated":"2022-02-12T10:32:56.013Z","comments":true,"path":"2022/02/09/寻找问题的答案/","link":"","permalink":"https://ylzxkk1.github.io/2022/02/09/%E5%AF%BB%E6%89%BE%E9%97%AE%E9%A2%98%E7%9A%84%E7%AD%94%E6%A1%88/","excerpt":"现在是2022年2月8日星期二，距离上次更新博客大概也有十几天了，最近卸载了很多nt软件，写了一些东西，发现逼迫自己和自己对话其实也是一件挺难的事。我想到陀思妥耶夫斯基曾说：“要爱具体的人，不要爱抽象的人。”我曾经也以为自己有着爱人的能力，并且认为自己爱着许多人。但最近我发现我的这个想法本身也很抽象，假若一个人连自我都无法爱上，又怎么会拥有爱他人的能力呢？","text":"现在是2022年2月8日星期二，距离上次更新博客大概也有十几天了，最近卸载了很多nt软件，写了一些东西，发现逼迫自己和自己对话其实也是一件挺难的事。我想到陀思妥耶夫斯基曾说：“要爱具体的人，不要爱抽象的人。”我曾经也以为自己有着爱人的能力，并且认为自己爱着许多人。但最近我发现我的这个想法本身也很抽象，假若一个人连自我都无法爱上，又怎么会拥有爱他人的能力呢？ 那么就是说，我对他人的爱都是假的吗？ 这个话题很复杂，在此时此刻我也无法给出一个明确的答案。因为我并不想承认我对他人的爱是假的，这很残忍。如果说有人的爱是士为知己者死，有人的爱是明确与唯一，那么给我对人和物的爱下一个定义的话，我想大概是因为“存在”所以会爱上。那么什么是存在呢？存在的是人，还是符号呢？因为美丽的外表，优越的成就所以会爱上他人的话，假若把人的内心剖开来看，是千疮百孔的样子，还会是一样的结局吗？如果把人的标签都抹去，真实的存在就摆在面前，无聊又无趣的想法不断地闪现，灰暗的生活会浇灭爱的本身吗？ 想着想着，我又会发现这些讨论为时过早。回到那句陀老的话，套用在我身上确实再合适不过：无法爱上具体的人，只能爱着抽象的人。即无法爱上现实的生活，和在现实生活中遇到的赤裸裸的人，所有细小的事和不断地奔波。我爱的只是蒙了一层滤镜的人或事。这样也就不难解释ACG在十几岁的时光里一度成为我生活的注解，甚至我整个人都是生活在一层雾蒙蒙的幻想中的，做着中二病般的幻想，幻想有一天异世界般的生活总会来临。但我的智力确实没有问题，不可能在内心深处知道它不会来临。也就是说，从一开始我就对生活不抱有期望。所谓的生活在别处，是听从内心的选择。于是对于现实不断地疏离。我承认这个想法一如既往的幼稚，我对它抱有的态度变化是奉为人生目标——发现世界的无聊——对自我和外界失望，进而不断批判自我——重新燃起一点希望。这个希望是什么现在暂且不谈，今天我只想搞明白我对于“我以外的人或事”的爱是如何运行的，写到这里我想到那句很有名的“他人即地狱”。那么在这里我们就把 “我以外的人或事”换算成“他人”。 首先我要搞明白的第一个问题是：连自己都不能喜欢的人，真的会喜欢/爱上他人吗？其实我觉得这并不矛盾，也许正是因为无法爱上自己，对自我充满了失望与厌恶，才会想要去他人那里寻找爱与答案。爱他人，因为他人光鲜，他人优越，他人拥有着我没有的能力，他人能做到我做不到的事。他人的人生即使有残缺也远优于我。这看起来很抽象，但他人在我这里蒙上了那一层雾蒙蒙的面具以后，就是值得我去爱的。 那么没有雾蒙蒙的面具呢?面具又是什么？ 这是我要搞明白的第二个问题：我爱的是他人本身，还是自己的幻想？因为如果没有幻想，他人和自我也就没什么分别（指在“我”的内心世界，非客观实际），正是我强加给他人的幻想使我深深地爱上了他人。如果他人有一点好，我便能根据这一点推出三点好，如果他人有一点坏，我便觉得他真实可以触碰。但如果是我有一点好，我就能把这一点归于所有人都有；如果我有一点坏，那么便不可原谅。是“我”在外界的碰壁使得我终于厌恶了自己，同时又把爱投向那些受到外界青睐的人，所以嘴上说着自己不在乎外界的看法与评价，实际上是在自己骗自己。写出这句话的时候我心揪了一下，确实，把自己真实的想法一点一点剖开来格外残忍，我又有点后悔搭什么博客写什么文章与自己对话了，但是既然做了，我就想把认识我自己贯彻到底。我又发现李诞说的那句话真对，人是不能自洽的，infp如我也离不开社会与外部的支持。那么我现在给出第二个问题的答案，虽然不想承认，但我爱的可能确实是自己的幻想。至少在现在如此，不然我也不会如此依赖网络与虚拟世界，因为真实的接触需要我本人的参与，而他人只需要站在那里我便觉得他无限好，“自顾自的喜欢自顾自的融入，自顾自的破防失望自顾自的离开”VTB圣经的话语真是到哪都适用。 我想要探讨的第三个问题是，我爱人的理由。这个问题其实与前两个有些重复，前面说到正是因为无法爱上自己，所以才会把爱投向他人，继而寻找答案。但是也没有这样简单，如果因为仅仅“他人优越，他人光鲜，他人更受外界的青睐”就会爱上他人的话，那么这世界上优秀的人如此之多，难道各个我都要去爱一遍吗？就为了那点可怜的自尊心？了解我的大概都知道我并非这样的人，甚至在很多时刻我对那些获得成就的人都持有反面的态度，大抵就是与我何干。我想问题的答案在我简单的生活中，现在我的逻辑并不足以支撑我把它说出来，我能说的仅仅是，“他人优越，他人光鲜，他人更受外界的青睐”不足以成为我爱人的理由。更多是一些生活的契机。其实这有关于自我感动，只能说很多时候我都迷恋爱人的感觉大于人本身。 “有人就是迷恋付出而得不到的爱”不难否认我属于这类人的一部分，有关回避型依恋与性单恋的讨论过于复杂，在此我不想过多赘述，但是我不希望我失去爱人的能力，当怀疑和失望不断地想要填满生活，爱是一张最后的底牌。诚然这世上有太多得不到回应的爱，尚且轮不到我来悲天悯人，但如果有可能的话，我许愿所有的爱都能温柔，不论是具体还是抽象，谎言抑或是幻想，我发誓我的感情不是假的。我对他人的爱也许也是对我自己的爱，因为我在上述的文章中承认了我爱的可能是自己的幻想，那么这个幻想也可以归结为自己的一部分。那么我就不能说我完全不爱自己了（其实傻子都知道这不可能）。但是不仅仅是幻想，因为我是真心希望某些人可以幸福快乐的，他的存在曾经是我想要活下去的意义。如果屏幕前的你看到这里怀疑这个人是不是在说自己，那么，是的，确实就是因为你的存在给我的生命增添了不可替代的意义，我曾经真心爱着你，真心愿你在尘世中获得幸福。至于我自己的结局，就去看看诗的下一句。 今天的话题既复杂又残忍，最后我搞清楚的事也没有多少，但多多少少起了一点“认识我自己”的作用，所以不能说是完全没有意义的。月亮注定要西沉，爱也许会消失，但是她曾经存在过就很好很好了。人生代代无穷已，江月年年望相似，月光确有一刻照在我身，于我而言，那就足够了。","categories":[],"tags":[]},{"title":"消解过去的意义","slug":"消解过去的意义","date":"2022-01-26T12:18:40.000Z","updated":"2022-02-07T15:35:41.379Z","comments":true,"path":"2022/01/26/消解过去的意义/","link":"","permalink":"https://ylzxkk1.github.io/2022/01/26/%E6%B6%88%E8%A7%A3%E8%BF%87%E5%8E%BB%E7%9A%84%E6%84%8F%E4%B9%89/","excerpt":"现在是2022年1月25日星期二，在某新区坐牢8天，百无聊赖在沙发上打了一天mirror之后，终于想起来更新一篇文章。 先说说这几天在干什么吧，打mirror，打植物大战僵尸，睡觉，找朋友聊天，做家务。琐碎，稀松，但是这样的生活对于我来说确实很难得，因为四个人的生活总归是比两个人要热闹有趣，也可以帮我戒咖啡瘾。想起6号那天和诺诺约会买的那杯奶茶，只喝了两口就匆匆扔下回到我的现实世界挨骂。那段时间也会在商区遇到问路的大妈，和麦当劳的骗子。步履匆匆，时间匆匆。但当我尝试给这些时间串上线的时候，却发现我会把时间线搞混。比如现在我已经分不清去年夏天的旅行和s12总决赛哪个更先出现在我的时间线里，但确实无所谓谁更先出现。因为最可怕的问题难道不是怀疑他们是否真的存在过吗？有时候会突发奇想：如果现实真的可以改变时间线，是不是就太好了？","text":"现在是2022年1月25日星期二，在某新区坐牢8天，百无聊赖在沙发上打了一天mirror之后，终于想起来更新一篇文章。 先说说这几天在干什么吧，打mirror，打植物大战僵尸，睡觉，找朋友聊天，做家务。琐碎，稀松，但是这样的生活对于我来说确实很难得，因为四个人的生活总归是比两个人要热闹有趣，也可以帮我戒咖啡瘾。想起6号那天和诺诺约会买的那杯奶茶，只喝了两口就匆匆扔下回到我的现实世界挨骂。那段时间也会在商区遇到问路的大妈，和麦当劳的骗子。步履匆匆，时间匆匆。但当我尝试给这些时间串上线的时候，却发现我会把时间线搞混。比如现在我已经分不清去年夏天的旅行和s12总决赛哪个更先出现在我的时间线里，但确实无所谓谁更先出现。因为最可怕的问题难道不是怀疑他们是否真的存在过吗？有时候会突发奇想：如果现实真的可以改变时间线，是不是就太好了？ 但我的时间线在各种网站上是有清晰的记忆的。还是会在各种论坛连轴转，看完那些不用点开就知道会有什么回复的贴子，千篇一律的视频，已经成为一种肌肉记忆。虽然抗、v很恶心，但我还是爱看。这是一种习惯，也是一种看待世界的方式。在这越来越脑瘫的因特网上我知道了世界上有地狱笑话就会有天堂鸡汤，但我不能总是恶心自己，也要给自己找点乐子，以免在现实世界中紫砂。写到这里我突然想到我推的v也说过“你们会无缘无故夸我可爱，就会无缘无故说我恶心”。我要说的差不多就是这个意思。 “若只是四处消遣生活，将来必定被生活所消遣”我又想起这句话来，初中读到的那本《被窝是青春的坟墓》。当时的我只想要把握当下，不要徒留遗憾，但是作为一个比初次读到这话时要年长的我自己，现在我对它又有了新的理解。因为现在的我并不能承认这种生活是毫无意义的，也许它（指被生活消遣）是个事实，但是我们都明白，真话并不好听。所以要尽量避免把它说出来。当然怎样解释都无所谓，未来我也注定会碰壁会遇到挫折，但把复杂的生活消解成简单的话语，本身就是一种十分逆天的行为。被生活消遣也许是命中注定，而导致结果的原因有很多种，唯独不能是自己给自己写岁月史书。可以被消解的是宏大的叙事，而不是复杂的生活，我要活下去，就必须去面对我的生活（所谓的my life）也免不了和他人的对比。我只是希望，生活本身不要被我自己亲手解构。。也希望自己可以开心。 开心吗？打出这个词的时候我有点惊讶，因为我突然发现那种恍惚现实的感觉已经不存在了。（“那种感觉”是活力的反面，药物的副作用和它的出现先后问题是先有鸡还是先有蛋的问题复刻）在2021的下半年，我经常会分不清现实和虚假，在这里并非指沉溺于网络或二次元世界，而是更倾向于“现实”的不可触碰。或者说对现实/真实的恐惧。确实这么多年过去了我依然是个非常幼稚的人，遇到困难，摆大烂。究竟有没有摆烂我不知道也说不清，毕竟对于“之后的我”，成功了就会说是运气，失败了自然是宿命。但是可以搞清楚的是，我一定会忍不住想要躲起来。毕竟面对，实在是太难了。那这和开心有什么关系?逃避就可以开心吗？当然啦。逃避可耻但有用。但，我也并不愿意逃避。因为问题迟早又会找上门——所以就是摆烂——逃避——拒绝逃避——挣扎的循环，很长的日子我都在这种内耗中度过，一分一毫有意义的事也没有做，但后来我安慰自己，至少我还爱着文学和历史，内陷至深的时候也会找点半吊子哲学来填补自己，有时候也会明知故问。比如问某个朋友数学定理是不是要经过严密的计算和推理才能获得；问哲学系的朋友自我本我和超我的区别；问另一个朋友某某教程在哪可以找到……回想起来确实是我nt，因为我明明知道问题的答案，但我还是想听别人亲口说出问题的答案，仿佛别人说出来的才是正确的。 消解宏大叙事是追求。年龄越增长我就越讨厌抽象的无法言说的东西，无关文学与艺术，而是表达的方式。可能是脑子越来越不好用了，我还是无法理解那些不具体的表述（无关数学），也更难接受事实真相。15岁时的梦想与现在的烦恼无关也有关，只是我要考虑事情多了起来。好像现在的我比起那时候多了一份理性，但少了一点神经与感触，只能说，我没有那么敏感了。我不知道这是好事还是坏事，但我确实要比前一段时间要快乐不少，即使没有人陪我沉溺在游戏里了。我也不知道这种心情可以持续多久，唯一可以确认的是：我想明白了一些事情。我希望我可以快乐，也希望我的朋友可以，还有曾经喜欢过的人，也要每天都快乐。我是发自内心的，因为爱着他们的时候，即使被冷落被忽视，我会认为那是自己的错。 晚安，祝每一天都能快乐。","categories":[],"tags":[]},{"title":"在虚拟里找真实——关于我搭建hexo博客的原因","slug":"在虚拟里找真实","date":"2022-01-14T14:37:51.000Z","updated":"2022-02-07T15:35:54.375Z","comments":true,"path":"2022/01/14/在虚拟里找真实/","link":"","permalink":"https://ylzxkk1.github.io/2022/01/14/%E5%9C%A8%E8%99%9A%E6%8B%9F%E9%87%8C%E6%89%BE%E7%9C%9F%E5%AE%9E/","excerpt":"现在是2022年1月13日星期四，在昨天我终于用github+hexo搭建出了属于自己的个人博客，查询了很多资料，看了很多教程与视频，也遇到了很多挫折，好在最后成功了。在今天的一番折腾后，成功下载了typora并且在博客上发了一首《春江花月夜》，不断地刷新之后我看到它出现了，激动的想要起飞，大概是因为作为非cs相关专业甚至非理工科生，产生想要搭博客的想法之后这几天遇到的难关实在是太多了。之后打开qq给帮我打开思路的网安大佬同学发了消息，臊皮了几句，现在，我想写下关于我个人博客的第一篇文章了。","text":"现在是2022年1月13日星期四，在昨天我终于用github+hexo搭建出了属于自己的个人博客，查询了很多资料，看了很多教程与视频，也遇到了很多挫折，好在最后成功了。在今天的一番折腾后，成功下载了typora并且在博客上发了一首《春江花月夜》，不断地刷新之后我看到它出现了，激动的想要起飞，大概是因为作为非cs相关专业甚至非理工科生，产生想要搭博客的想法之后这几天遇到的难关实在是太多了。之后打开qq给帮我打开思路的网安大佬同学发了消息，臊皮了几句，现在，我想写下关于我个人博客的第一篇文章了。 首先，为什么我要搭这个网站呢？我想，除去曾经看到很多别人的blog网站觉得很酷以外，应该就是因为怕出现“意外”吧（也许并不是意外）。2021年的夏天我去看了心理医生，因为自己不稳定的情绪。我收获的大概是“交给时间”等一系列模糊的回答，还有一些抗抑郁的药物。直至今日我还是想不明白那个说出我“症状并不是很重”的医生为什么会给我开出米氮平，在学完药理学之后，我依旧没有找到答案。这个nt药物带给我的大概只是无尽的嗜睡和体重增加的副作用，至于我的情绪在那一段时间有没有改善，我想我大概已经忘记了，我只知道在2021年的9月29日我写下了一篇很丧的文章，即使是将近半年后的今天我仍愿意去认真读一遍，而不是像平常对待我写过的文章那样嗤之以鼻。 在那篇文章中，我写下了这样的话：“我是怎么样的人呢？“糟糕”可以评价我至今为止的人生吗？现在我写下这些话，犹如蒙马特遗书一般的回忆，它像一本演讲稿一样，每天在我的可爱的日子里不断地重复，直到我生命的终结，死亡的开始。然而，我并没有邱妙津那样的才华；我也厌恶好的天气。晴天和太阳总是令我暴躁，比起强烈的阳光，我更喜爱阴雨与光线暗淡的房间，我希望在这样的房间里，可以一个人实现自己的梦想。” 时隔半年，我反复揣测我当时想要表达的意义。我认为那时那个情绪极不稳定的我，想要的大概是一种环境或是一种自我，而这种自我大概只能在梦里存在，因为它并不能融入所谓现实社会。但人是不能脱离环境遗世独立的，至少现在的我不能做到。我只能每天打开sb社交软件，日复一日的恶心自己。 再回到那个问题来。所谓“意外”，是指什么？我认为最接近问题的答案的词语，应该就是死亡。这是指笔者明天就会玉玉症紫砂吗？并不是这样。我不知道我有没有精神疾病，但药物确实曾经是我最亲密的陪伴，在我每一个想要把身边的东西都摔坏的晚上。这里的意外大概就是指最表面的“意外”，由于外界的因素或者我个人的冲动，所造成的不可挽回的后果，它包括但不限于死亡。说实话我也不知道自己在失控时会做出什么事，“面对”一直都是一个残酷的话题。毕竟我从来都不能做到喜欢我自己，和自己的生活。但在这里写下这些话的时刻，我并不希望很长时间过后它沦为我自己对自己的笑柄，也希望这份心情可以传达给未来的自己。至于能不能传达给阅读这篇文章的“他人”，我想我并不知道，因为我写下的话实在太过谜语……我也并不期盼“他人的理解”，因为我自己尚且做不到“理解我自己”。 “认识你自己”是德尔菲神庙的名言。是在世界史苏格拉底那一章节讲到的。在高中毕业许多年后我仍不能很好的理解这句话，但冥冥之中我感到也许类似的追求将会伴随着我们的一生。也许终其一生我都寻找不到问题的答案，寻找的过程也并不愉悦，甚至令人感到悲伤，但是我愿意去找，甚至愿意去做类似的很多种这样的事。我就是这样拧巴的一个人，这也是我想要用博客来记录的原因之一，就是认识我自己。 接下来要说的事，有关于反思和逃避。自从2015年的夏天过后，我每一天在做的事情都可以称之为“逃避”。至少在外界看来如此。那么现在是我终于意识到我不该去逃避了吗？并不是。而是从一开始我就知道自己不该逃避。。。那为什么还要去逃避呢，问题的答案是，我不知道。 只好不断地询问自己，真的在逃避吗？真的在逃避吗？真的在逃避吗？…………… 我发现我能给出的回答是，我没有。 这就是我搭这个博客的第三个原因，和自己对话。因为时至今日我终于明白有时候外界的声音，并不能全然反应出一个人现实的状态，而我大概是被外界推着走的。我是一面太乖的镜子，我希望可以通过逼迫自己写作并与自己对话，减少外界声音对自己的影响，从而找到自己真正该做的事该走的路。如果真的有明天，如果确实有未来，如果将来真的会来临而到时候并没有意外发生，我希望自己能不因碌碌无为而羞愧。这也与那个“遗世独立”的愿望其实是一个虚空的愿望有关。这也是我面对现实的勇气的一部分。 现在，我可以总结一下我搭个人博客的原因了： 一.怕会有意外发生，除了器官捐献以外，这大概是我能留下来的唯一 （说实在的我对自己的生命并不抱有期望，这个话题可以以后再谈） 二.认识我自己 三.逼迫自己写作与反思，和自己对话，这和第二点有莫大的关系 四.寻找个人区，摒弃微博与朋友圈等熟人社会，这和第三点有莫大的关系 那么，写到这里，就该说晚安了。","categories":[],"tags":[]},{"title":"春江花月夜","slug":"春江花月夜","date":"2022-01-13T12:10:13.000Z","updated":"2022-02-08T03:37:04.784Z","comments":true,"path":"2022/01/13/春江花月夜/","link":"","permalink":"https://ylzxkk1.github.io/2022/01/13/%E6%98%A5%E6%B1%9F%E8%8A%B1%E6%9C%88%E5%A4%9C/","excerpt":"春江潮水连海平，海上明月共潮生。 滟滟随波千万里，何处春江无月明！ 江流宛转绕芳甸，月照花林皆似霰； 空里流霜不觉飞，汀上白沙看不见。","text":"春江潮水连海平，海上明月共潮生。 滟滟随波千万里，何处春江无月明！ 江流宛转绕芳甸，月照花林皆似霰； 空里流霜不觉飞，汀上白沙看不见。 江天一色无纤尘，皎皎空中孤月轮。 江畔何人初见月？江月何年初照人？ 人生代代无穷已，江月年年望相似。 不知江月待何人，但见长江送流水。 白云一片去悠悠，青枫浦上不胜愁。 谁家今夜扁舟子？何处相思明月楼？ 可怜楼上月裴回，应照离人妆镜台。 玉户帘中卷不去，捣衣砧上拂还来。 此时相望不相闻，愿逐月华流照君。 鸿雁长飞光不度，鱼龙潜跃水成文。 昨夜闲潭梦落花，可怜春半不还家。 江水流春去欲尽，江潭落月复西斜。 斜月沉沉藏海雾，碣石潇湘无限路。 不知乘月几人归，落月摇情满江树。","categories":[],"tags":[{"name":"诗词","slug":"诗词","permalink":"https://ylzxkk1.github.io/tags/%E8%AF%97%E8%AF%8D/"}]}],"categories":[],"tags":[{"name":"诗词","slug":"诗词","permalink":"https://ylzxkk1.github.io/tags/%E8%AF%97%E8%AF%8D/"}]}